app/views/users/index.html.erb

SELECT `users`.* FROM `users`
---
     <tbody id="myTable">
      <% User.all.each do |user| %>