app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `body`, `description`, `spec`, `user_id`, `created_at`, `updated_at`) VALUES ('asd', 'q', 'asdgaxcz', 123, 1, '2018-11-11 22:22:38', '2018-11-11 22:22:38')